#include "GameScene.h"

#include "ImGuiManager.h"
#include "TextureManager.h"
#include "ModelManager.h"


/*////////////////////////////////////////////////////////////////////////////////
*								コンストラクタ
////////////////////////////////////////////////////////////////////////////////*/
GameScene::GameScene() {

	/*======================================================*/
	// 2Dカメラ

	// 生成
	camera2D_ = std::make_unique<Camera2D>();

	// 初期化
	camera2D_->Initialize();

	/*======================================================*/
	// 3Dカメラ

	// 生成
	camera3D_ = std::make_unique<Camera3D>();

	// 初期化
	camera3D_->Initialize();

	/*======================================================*/
	// 2Dオブジェクト



	/*======================================================*/
	// 3Dオブジェクト

	// 生成
	triangle_ = std::make_unique<Object3D>();
	// 初期化
	triangle_->Initialize(
		camera3D_.get(), Object3DType::Triangle, Normal, kBlendModeNormal, "uvChecker.png", "");
	triangle_->InitializeCBuffer("triangle");

	// 生成
	sphere_ = std::make_unique<Object3D>();
	// 初期化
	sphere_->Initialize(
		camera3D_.get(),Object3DType::Sphere,PhongReflection,kBlendModeNormal, "uvChecker.png", "");
	sphere_->InitializeCBuffer("sphere");

	// 生成
	model_ = std::make_unique<Object3D>();
	// 初期化
	model_->Initialize(
		camera3D_.get(), Object3DType::Model, PhongReflection, kBlendModeNormal, "monsterBall.png", "axis.obj");
	model_->InitializeCBuffer("model");
}

/*////////////////////////////////////////////////////////////////////////////////
*								  デストラクタ
////////////////////////////////////////////////////////////////////////////////*/
GameScene::~GameScene() {

	camera2D_.reset();
	camera3D_.reset();
	triangle_.reset();
	sphere_.reset();
	model_.reset();
}


/*////////////////////////////////////////////////////////////////////////////////
*								    更新処理
////////////////////////////////////////////////////////////////////////////////*/
void GameScene::Initialize() {

	/*======================================================*/
	// 2Dカメラ

	camera2D_->Initialize();

	/*======================================================*/
	// 3Dカメラ

	camera3D_->Initialize();

	/*======================================================*/
	// 2Dオブジェクト



	/*======================================================*/
	// 3Dオブジェクト



}



/*////////////////////////////////////////////////////////////////////////////////
*								    更新処理
////////////////////////////////////////////////////////////////////////////////*/
void GameScene::Update() {

	/*======================================================*/
	// ImGui



	/*======================================================*/
	// 2Dカメラ

	camera2D_->Update();

	/*======================================================*/
	// 3Dカメラ

	camera3D_->Update();

	/*======================================================*/
	// 2Dオブジェクト



	/*======================================================*/
	// 3Dオブジェクト

	triangle_->Update(camera3D_.get());
	sphere_->Update(camera3D_.get());
	//model_->Update(camera3D_.get());
}

/*////////////////////////////////////////////////////////////////////////////////
*								    描画処理
////////////////////////////////////////////////////////////////////////////////*/
void GameScene::Draw() {

	/*======================================================*/
	// 2Dオブジェクト



	/*======================================================*/
	// 3Dオブジェクト

	triangle_->Draw();
	//sphere_->Draw();
	//model_->Draw();

}