#include "GameScene.h"

#include "ImGuiManager.h"
#include "TextureManager.h"
#include "ModelManager.h"


/*////////////////////////////////////////////////////////////////////////////////
*								コンストラクタ
////////////////////////////////////////////////////////////////////////////////*/
GameScene::GameScene() {

	/*======================================================*/
	// 2Dカメラ

	// 生成
	camera2D_ = std::make_unique<Camera2D>();

	// 初期化
	camera2D_->Initialize();

	/*======================================================*/
	// 3Dカメラ

	// 生成
	camera3D_ = std::make_unique<Camera3D>();

	// 初期化
	camera3D_->Initialize();

	/*======================================================*/
	// 2Dオブジェクト



	/*======================================================*/
	// 3Dオブジェクト



	/*--------------------------------------------*/
	/*  plane 平面  */

	// 生成
	plane_ = std::make_unique<Object3D>(Object3DType::Model);

	// 初期化
	plane_->Initialize(camera3D_.get());
	plane_->SetRotate({ 0.0f,std::numbers::pi_v < float>,0.0f });

	// Lighting設定
	plane_->SetEnableLighting(false);

	// 描画タイプ
	planeDrawType_ = Texture;

	// ブレンドモード
	planeBlendMode_ = kBlendModeNormal;

	// モデル読み込み
	ModelManager::GetInstance()->LoadGLTFModel("./Resources/Gltf", "plane.gltf");
	planeModelName_ = "plane";

	// テクスチャ読み込み
	TextureManager::GetInstance()->LoadTexture("./Resources/Images/uvChecker.png");
	planeTextureName_ = "uvChecker";

	// gltf使用
	plane_->SetIsUseGLTFModel(true, planeModelName_);

}

/*////////////////////////////////////////////////////////////////////////////////
*								  デストラクタ
////////////////////////////////////////////////////////////////////////////////*/
GameScene::~GameScene() {

	camera2D_.reset();
	camera3D_.reset();
	plane_.reset();
}


/*////////////////////////////////////////////////////////////////////////////////
*								    更新処理
////////////////////////////////////////////////////////////////////////////////*/
void GameScene::Initialize() {

	/*======================================================*/
	// 2Dカメラ

	camera2D_->Initialize();

	/*======================================================*/
	// 3Dカメラ

	camera3D_->Initialize();

	/*======================================================*/
	// 2Dオブジェクト



	/*======================================================*/
	// 3Dオブジェクト

	// 平面
	plane_->Initialize(camera3D_.get());

}



/*////////////////////////////////////////////////////////////////////////////////
*								    更新処理
////////////////////////////////////////////////////////////////////////////////*/
void GameScene::Update() {

	/*======================================================*/
	// 2Dカメラ

	camera2D_->Update();

	/*======================================================*/
	// 3Dカメラ

	camera3D_->Update();

	/*======================================================*/
	// 2Dオブジェクト



	/*======================================================*/
	// 3Dオブジェクト

	// 平面
	plane_->UpdateImGui("plane");
	plane_->Update(camera3D_.get());

}

/*////////////////////////////////////////////////////////////////////////////////
*								    描画処理
////////////////////////////////////////////////////////////////////////////////*/
void GameScene::Draw() {

	// 3DCameraのImGui
	camera3D_->ImGuiDraw();

	/*======================================================*/
	// 2Dオブジェクト



	/*======================================================*/
	// 3Dオブジェクト

	// 平面
	plane_->Draw(planeDrawType_, planeBlendMode_, planeTextureName_, planeModelName_);

}